[
    {
        "version": "0.4.1",
        "date": "2026-02-20",
        "changes": {
            "Fixed": [
                "Tablet Media Query: Changed breakpoint from max-width: 1024px to min-width: 641px and max-width: 1024px so tablet styles no longer conflict with the mobile breakpoint.",
                "Tablet Layout Width: Added width: 100% and overflow-x: hidden to .page-wrapper at tablet viewports, fixing content being crammed into a narrow column with a dead gray area on the right.",
                "Tablet Navbar: Explicitly kept the desktop navbar visible and hamburger menu hidden at tablet widths."
            ]
        }
    },
    {
        "version": "0.4.0",
        "date": "2026-02-19",
        "changes": {
            "Added": [
                "AI Assistant Modal: Full chat interface powered by Groq (llama-3.1-8b-instant) with real portfolio context.",
                "Express Backend Server: Dedicated Node.js/Express server in server/ with health-check, CORS, and Groq API integration.",
                "Quick-Question Chips: One-click prompt buttons for Skills, Projects, Education, and Experience on first load.",
                "Animated Message Bubbles: Per-message slide-in animation with distinct user and assistant avatars.",
                "Dot-Grid Chat Background: Subtle grid pattern in the message area for a premium neobrutalist feel.",
                "Scanline Header Stripe: Decorative repeating stripe above the modal header.",
                "Live Status Indicator: Pulsing dot with online/offline/connecting state and message count in the modal header.",
                "Character Counter: Live character count shown while typing in the input field.",
                "Keyboard Shortcuts Bar: Styled kbd hints for Enter, Shift+Enter, and Esc in the modal footer.",
                "ESLint Node Config: Added server-specific ESLint block with globals.node and commonjs sourceType."
            ],
            "Fixed": [
                "ESLint Server Errors: Resolved 11 no-undef errors for require, process, and __dirname in server/index.js."
            ]
        }
    },
    {
        "version": "0.3.1",
        "date": "2026-02-19",
        "changes": {
            "Added": [
                "Realistic 3D Book Flip: Unified leaf structure with backface-visibility for a true physical page turn.",
                "Snap-to-State Logic: Debounced interaction ensures the book always finishes flipping to open or closed.",
                "Animation Viewport Intelligence: Intersection Observer support added to Paper Tear for zero CPU overhead off-screen.",
                "Terminal Session Logic: Added visual divider lines after command responses for better message tracking."
            ],
            "Fixed": [
                "Page Tear Optimization: Eliminated scroll lag by resolving CSS transition conflicts and adding state-locking.",
                "Journey Rendering: Fixed 'ghost printing' where timeline content appeared before the flip animation.",
                "Terminal UI: Removed distracting global sidebar, mute/history buttons, and vibe notifications from the terminal route."
            ]
        }
    },
    {
        "version": "0.3.0",
        "date": "2026-02-19",
        "changes": {
            "Added": [
                "Vibe Check System: Cycle through Neon, Retro, Minimal, and Default themes.",
                "Global Contrast Sweep: Theme-aware content colors for perfect accessibility.",
                "Vibe Switch Notifications: Centered on-screen alerts when themes change.",
                "Floating Sound Controls: Global mute toggle for reactive sound effects."
            ],
            "Fixed": [
                "Version History Contrast: Improved visibility for history and mute buttons across all themes.",
                "Core Navigation: Refined button contrast in Navbar, Skills, and Projects sections."
            ]
        }
    },
    {
        "version": "0.2.6",
        "date": "2026-02-18",
        "changes": {
            "Added": [
                "Custom Cursor: Neo-brutalist adaptive cursor with hover states and ring-dot design.",
                "Terminal Route Cursor: Specialized block cursor style for the retro terminal environment.",
                "Reactive Click Sound: Synthesized tech-snap sound on click using Web Audio API.",
                "Custom Selection Styling: Theme-matching text selection colors for Home and Terminal."
            ],
            "Changed": [
                "Global Styles: Hidden default browser cursor to prioritize the custom interactive experience."
            ]
        }
    },
    {
        "version": "0.2.5",
        "date": "2026-02-18",
        "changes": {
            "Added": [
                "Technical SEO Suite: Comprehensive metadata for Twitter, Open Graph, and search engines.",
                "Structured Data: Implemented JSON-LD Person schema for identity mapping.",
                "Crawler Assets: Added robots.txt and sitemap.xml to the public directory."
            ],
            "Changed": [
                "Domain Configuration: Unified all SEO assets and canonical links to https://arinjain.xyz."
            ]
        }
    },
    {
        "version": "0.2.4",
        "date": "2026-02-18",
        "changes": {
            "Fixed": [
                "Navbar Theme Switcher: Fixed a prop name mismatch that prevented the theme toggle from working."
            ]
        }
    },
    {
        "version": "0.2.3",
        "date": "2026-02-18",
        "changes": {
            "Added": [
                "Map Label Positioning: Support for bottom-positioned labels to prevent marker clashing.",
                "Timeline UI: Restored the vertical connector line for the last item to maintain visual consistency."
            ],
            "Fixed": [
                "Map Centering: Offsets camera to focus on the info box (popup) instead of the pin.",
                "Map Popup UI: Scrollable content for multiple entries and a themed close button.",
                "Map Legibility: Removed popup transparency for better reading."
            ]
        }
    },
    {
        "version": "0.2.2",
        "date": "2026-02-18",
        "changes": {
            "Added": [
                "Version History Modal: Floating button (FAB) to browse project evolution.",
                "Neo-brutalist modal design with theme support."
            ],
            "Fixed": [
                "Map Overlay: Removed unwanted arrow image from the journey map."
            ]
        }
    },
    {
        "version": "0.2.1",
        "date": "2026-02-18",
        "changes": {
            "Added": [
                "Physical Book Flip: Redesigned the 'My Journey' flip with backface-visibility: hidden.",
                "Vercel Deployment: Added vercel.json for client-side routing and reloads."
            ],
            "Changed": [
                "Mobile Paper Tear: Removed gray parallax gap/color on mobile for cleaner transitions.",
                "Responsive Footer: Centered layout and improved vertical stacking on small screens."
            ],
            "Fixed": [
                "Fixed 'white screen' crash caused by missing useState import.",
                "Eliminated sub-pixel color bleeding in paper tear SVGs.",
                "Refined sidebar shadow behavior to hide when the book is open."
            ]
        }
    },
    {
        "version": "0.2.0",
        "date": "2026-02-18",
        "changes": {
            "Added": [
                "Interactive Terminal: Retro-style route (/terminal) with dynamic theme switching.",
                "Dynamic ASCII Art: Figlet integration for real-time terminal art.",
                "CGPA Display: Added to education section.",
                "Language Stars Counter: Fixed proficiency star visualization.",
                "Paper Tear Effect: Implemented jagged separator with deterministic paths.",
                "Tape Sticker: Interactive component with corrected positioning."
            ],
            "Changed": [
                "Journey Book Flip: 레드esigned 3D animation to be smoother.",
                "Map Integration: Refined markers and positioning.",
                "Brutalism Aesthetic: Unified design system with borders and shadows.",
                "Responsive Navigation: Improved navbar tracking."
            ],
            "Fixed": [
                "Fixed marker icons loading in Leaflet.",
                "Resolved overlapping in Journey grid.",
                "Fixed z-index conflicts in 3D components."
            ]
        }
    },
    {
        "version": "0.0.1",
        "date": "2026-02-14",
        "changes": {
            "Added": [
                "Initial project setup with Vite + React.",
                "Basic component structure.",
                "Integration of Leaflet maps."
            ]
        }
    }
]